import os

import discord
from dotenv import load_dotenv

from gacha import gacha

load_dotenv()

TOKEN = os.getenv("DISCORD_BOT_TOKEN")

intents = discord.Intents.default()
intents.message_content = True

client = discord.Client(intents=intents)


@client.event
async def on_ready():
    print(f"logged in as {client.user}")


@client.event
async def on_message(message):
    # do not respond to bot messages
    if message.author.bot:
        return

    if message.content.startswith("!gacha"):
        try:
            response = gacha(message.content.split("\n", maxsplit=1)[1])
        except Exception as e:
            response = (
            "❌ 失敗: 入力方法が正しくありません！\n"
            '"?gacha" コマンドで使い方を確認してください'
        )

        await message.channel.send(response)
    elif message.content == "?gacha":
        response = (
            "## 💸 ガチャガチャシミュレータ\n"
            "引きたいガチャを揃えるのに必要な回数をシミュレーションしよう！\n\n"
            "```\n"
            "!gacha\n"
            "[アイテム名], [出現確率 (または確率の整数比)], [必要数 (オプション, デフォルトは1)]\n"
            "...\n"
            "```\n"
            "### ✏️ 例: 出現確率0.01(=1%) のアイテムを1個ゲットするのに何回ガチャが必要？\n"
            "```\n"
            "!gacha\n"
            "アイテムA, 0.01\n"
            "```\n"
            "```\n"
            "1%: 1回\n"
            "5%: 6回\n"
            "10%: 11回\n"
            "20%: 23回\n"
            "25%: 29回\n"
            "50%: 69回\n"
            "75%: 138回\n"
            "80%: 161回\n"
            "90%: 230回\n"
            "95%: 299回\n"
            "99%: 459回\n"
            "平均: 100.00回\n"
            "標準偏差: 99.50回\n"
            "最頻値: 1回\n"
            "```\n"
            "↑ 「○○%: xx回」は, xx回引けば○○%の確率でアイテムが揃うという意味です\n\n"
            "### ✨ 応用\n"
            "アイテムは複数指定できるぞ！"
            "```\n"
            "!gacha\n"
            "アイテムA, 0.1\n"
            "アイテムB, 1/100  (☜分数表記も可！)\n"
            "アイテムC, 1/1000, 2  (☜必要数を2個に指定)\n"
            "```\n"
            "確率を整数比として指定することも可（出現確率を全て整数で指定）"
            "```\n"
            "!gacha\n"
            "大当たり, 1  (☜1/6の確率)\n"
            "あたり, 2  (☜2/6の確率)\n"
            "ハズレ, 3, 0  (☜3/6の確率, 必要数0なので取っても無駄)\n"
            "```\n"
            "### ⚠️ 注意\n"
            "サーバでゴリゴリの行列計算をしている都合上、以下のようなアイテムリストを指定するとタイムアウトします...\n"
            "- あまりにも出現確率が低すぎるアイテム\n"
            "- 異なるアイテム/出現確率/必要数の組み合わせが多すぎるパターン"
        )
        await message.channel.send(response)


client.run(TOKEN)
