import os

import discord
from dotenv import load_dotenv

from gacha import gacha

# .envファイルから環境変数を読み込む
load_dotenv()

# 環境変数からトークンを取得する
TOKEN = os.getenv("DISCORD_BOT_TOKEN")

# すべてのイベントに対して反応するIntentsオブジェクトを作成
intents = discord.Intents.default()
intents.message_content = True  # メッセージの内容を受け取るための権限を付与

# Discordのクライアントを作成
client = discord.Client(intents=intents)


@client.event
async def on_ready():
    print(f"{client.user}としてログインしました")


@client.event
async def on_message(message):
    # Bot自身のメッセージには反応しないようにする
    if message.author.bot:
        return

    if message.content.startswith("!gacha"):
        # 応答するメッセージを作成
        try:
            response = gacha(message.content.split("\n", maxsplit=1)[1])
        except Exception as e:
            responce = f"❌ 失敗: 予期しないエラーが発生しました！\n```\n{e}\n```"

        await message.channel.send(response)
    elif message.content == "?gacha":
        response = (
            "## 💸 ガチャガチャシミュレータ\n"
            "引きたいガチャを揃えるのに必要な回数をシミュレーションしよう！\n\n"
            "### ✏️ 例: 出現確率0.01(=1%) のアイテムを1個ゲットするのに何回ガチャが必要？\n"
            "```\n"
            "!gacha\n"
            "アイテムA, 0.01  (☜ [アイテム名], [出現確率], [必要数 (オプション)])\n"
            "```\n"
            "```\n"
            "1%: 1回\n"
            "5%: 6回\n"
            "10%: 11回\n"
            "20%: 23回\n"
            "25%: 29回\n"
            "50%: 69回\n"
            "75%: 138回\n"
            "80%: 161回\n"
            "90%: 230回\n"
            "95%: 299回\n"
            "99%: 459回\n"
            "平均: 100.00回\n"
            "標準偏差: 99.50回\n"
            "最頻値: 1回\n"
            "```\n"
            "↑ 「○○%: xx回」は, xx回引けば○○%の確率でアイテムが揃うという意味です\n\n"
            "### ✨ 応用\n"
            "アイテムは複数指定できるぞ！"
            "```\n"
            "!gacha\n"
            "アイテムA, 0.1\n"
            "アイテムB, 1/100  (☜分数表記も可！)\n"
            "アイテムC, 1/1000, 2  (☜3番目の値で必要数も変更可！)\n"
            "```\n"
            "### ⚠️ 注意\n"
            "サーバでゴリゴリの行列計算をしている都合上、以下のようなアイテムリストを指定するとタイムアウトします...\n"
            "- あまりにも出現確率が低すぎるアイテム\n"
            "- 異なるアイテム/出現確率/必要数の組み合わせが多すぎるパターン"
        )
        await message.channel.send(response)


client.run(TOKEN)
