import os

import discord
from dotenv import load_dotenv

from gacha import gacha

load_dotenv()

TOKEN = os.getenv("DISCORD_BOT_TOKEN", "")
CHANNEL_ID = os.getenv("CHANNEL_ID", "")

intents = discord.Intents.default()
intents.message_content = True

client = discord.Client(intents=intents)


@client.event
async def on_ready():
    print(f"logged in as {client.user}")


@client.event
async def on_message(message: discord.message.Message):
    # do not respond to bot messages
    if message.author.bot:
        return

    # respond only selected channel
    print(
        type(message),
    )
    if message.channel.id != int(CHANNEL_ID):
        return

    if message.content.startswith("!gacha"):
        try:
            response = gacha(message.content.split("\n", maxsplit=1)[1])
        except Exception:
            response = (
                "❌ **失敗**: 入力方法が正しくありません！\n"
                '"?gacha" コマンドで使い方を確認してください'
            )

        await message.channel.send(response)
    elif message.content == "?gacha":
        response = (
            "## 💸 ガチャガチャシミュレータ\n"
            "引きたいガチャを揃えるのに必要な回数をシミュレーションしよう！\n\n"
            "```\n"
            "!gacha\n"
            "アイテム名, 出現確率 [, 必要数] [, 重複数]\n"
            "... (複数のアイテムを指定する場合2行目と同様)\n"
            "```\n"
            "- **アイテム名** (文字列): アイテムの名前\n"
            "    - 単なるラベルであり, それぞれの行は名前が同じでも違うアイテムとして処理される)\n"
            "- **出現確率** (数値): アイテムの出現確率 (少数or分数, 0<p≤1), または出現確率の整数比 (1以上の整数)\n"
            "    - すべての出現確率は 0<p≤1 の確率表記, あるいは整数比の表記のどちらかに統一すること\n"
            "- **必要個数** (数値): 収集に必要な数 (0以上の整数). 省略した場合は1.\n"
            "- **重複数** (数値): 現在行をいくつに複製するか (1以上の整数). 省略した場合は1.\n"
            "    - 例えば `アイテムA, 0.1, 1, 2` と指定した場合, `アイテムA, 0.1, 1` を2行分書いたのと同様.\n"
            "  - 重複数を指定する場合は必要個数も必須\n"
            "### ✏️ 例: 高レアな推しキャラと低レアの不特定のキャラを集めるとき\n"
            "```\n"
            "!gacha\n"
            "★5推し, 0.001\n"
            "★4推し, 1/100  (☜ 出現確率は分数でも少数でも良い)\n"
            "★3推し, 2/100, 1, 3  (☜ 特定の★3推しキャラを1体ずつ)\n"
            "★2キャラ, 30/100, 3  (☜ 不特定の★2キャラを3体)\n"
            "```\n"
            "あるいはのように書いても結果は同じ\n"
            "```\n"
            "!gacha\n"
            "★5推し, 1  (☜ 出現確率を全体の整数比で表している)\n"
            "★4推し, 10\n"
            "★3推しA, 20, 1  (☜ 重複数による複製)\n"
            "★3推しB, 20, 1\n"
            "★3推しC, 20, 1\n"
            "★2キャラ, 300, 3\n"
            "★1キャラ, 629, 0  (☜ 必要数が0なので引いても効果がない)\n"
            "```\n"
            "```\n"
            "1%: 63回\n"
            "5%: 112回\n"
            "10%: 157回\n"
            "20%: 251回\n"
            "25%: 307回\n"
            "50%: 694回\n"
            "75%: 1386回\n"
            "80%: 1609回\n"
            "90%: 2302回\n"
            "95%: 2995回\n"
            "99%: 4603回\n"
            "平均: 1012.43回\n"
            "標準偏差: 989.11回\n"
            "最頻値: 151回\n"
            "```\n"
            "↑ 「○○%: xx回」は, xx回引けば○○%の確率でアイテムが揃うという意味\n\n"
            "### ⚠️ 注意\n"
            "計算の組み合わせ爆発が起きやすいので、以下のようなアイテムリストを指定するとタイムアウトします...\n"
            "- あまりにも出現確率が低すぎるアイテム\n"
            "- 異なるアイテム/出現確率/必要数の組み合わせが多すぎるパターン"
        )
        await message.channel.send(response)


client.run(TOKEN)
